export interface Config {
  [protocolVersion: string]: {
    // how large is one item. range: 1-70
    bitSize: number
    ratingType: 'xp-star'
    items: string[]
    sections: Array<{
      displayName: string
      items: string[]
    } | { desc: string }>
    descs?: Record<string, string>
  }
}

const v1Data = {
  sections: [
    {
      displayName: '性偶',
      items: ['多人性交', '深喉', '口交', '颜射', '乳交', '后入', '内射', '拉珠', '扩张(阴道)', '扩张(肛门)', '拳交(阴道)', '拳交(肛门)', '塞子(小)', '塞子(中)', '塞子(大)', '灌肠', '异物塞入', '食物塞入', '炮机', '电动玩具塞入', '双玩具塞入', '吹潮失禁', '强制高潮', '控制高潮', '拒绝高潮', '多次高潮', '文爱', 'Dirty Talk']
    },
    {
      displayName: 'Kigurumi',
      items: ['k8', 'k9', '马化', '面具', '模仿叫声', '笼子关押', '项圈/镣铐', '饲养(短期)', '饲养(长期)', '被用脚喂食', '宠物式进食', '服务(常规)', '服务(使用嘴)', '爬行', '舔足', '舔鞋', '舔性器官', '踩踏', '出行', '禁言', '坐脸', '坐身体', '插件尾巴']
    },
    {
      displayName: '捆绑/拘束',
      items: ['功能性绳缚', '美观绳缚', '乳头摩擦绳缚', '性器官摩擦绳缚', '胶带捆绑', '保鲜膜捆绑', '木质拘束器', '皮质拘束器', '金属拘束器', '拘束衣', '单手套', '全身悬吊', '平衡悬吊', '倒立悬吊', '鞭打柱', '十字架', 'X 字架', '手铐/脚铐', '颈腰脚连铐', '睡袋拘束', '真空床', '驷马', '分腿器', '露出(郊野)', '露出(公开)', '公开绳缚表演']
    },
    {
      displayName: '兴趣',
      items: ['制服', '西装', '正太', '叔叔', '幼女', '阿姨', '同性', '异性', '手部', '颜值', '臀部', '足部', '肌肉']
    },
    {
      displayName: '角色扮演',
      items: ['角色扮演', '审讯', '绑架', '强暴', '囚犯', '医疗', '教育', '怪物入侵', '婴儿', '烹饪', '服务员', '女仆', '物品扮演']
    },
    {
      displayName: '玩法/道具',
      items: ['SP(轻度)', 'SP(中度)', 'SP(重度)', '掌掴(无痕迹)', '掌掴(有痕迹)', '口球', '衣物堵嘴', '充气口球', '阴茎/条形口塞', '胶条封嘴', '拉扯头发', '皮带', '藤条', '木棒', '戒尺', '散鞭', '马鞭', '蛇鞭', '毛刷', '手心', '脚心', '其他搔痒', '腹部拳击', '其他拳击', '咬', '虐待性器官', '器具吸乳', '乳夹', '乳夹(承重)', '阴夹', '滴蜡', '电击按摩', '冰块', '冰块插入', '木马', '走绳结']
    },
    {
      displayName: '身体控制',
      items: ['全时主奴', '佩戴饰品(隐蔽)', '佩戴饰品(明显)', '视觉控制', '听觉控制', '如厕隔离', '食物控制', '睡眠控制', '衣着控制', '行为控制', '体重控制', '强制运动', '强制服药', '性交控制(短期)', '性交控制(长期)', '剃毛(阴部)', '剃毛(全身)']
    },
    {
      displayName: '社交',
      items: ['拍照(无脸)', '拍照(露脸)', '视频(无脸)', '视频(露脸)', '多主', '多奴', '奴下奴']
    },
    {
      displayName: '露出',
      items: ['郊野', '公开', '露出奴役', '露出流放', '露出性爱', '露出爱抚', '露阴(向主人)', '露阴(向陌生人)']
    },
    {
      desc: '注意：前方进入深水区，可能引起不适'
    },
    {
      displayName: '精神控制',
      items: ['脏话侮辱', '语言侮辱', '人格侮辱', '思维控制', '视觉控制', '网络控制', '语言管教', '网络公调', '视频表演', '观看成人电影']
    },
    {
      displayName: '动物',
      items: ['昆虫', '兽交', '兽交(多个)', '人兽同交', '兽虐']
    },
    {
      displayName: '代谢',
      items: ['灌肠(惩罚目的)', '精液', '“圣水”', '“黄金”', '“圣水”浴', '厕后舔肛', '排便', '放尿']
    }
  ],
  descs: {
    k8: '猫化',
    k9: '犬化',
    公开绳缚: '例如聚会',
    正太: '仅限幻想作品',
    幼女: '仅限幻想作品',
    同性: '以性别认同为准',
    异性: '以性别认同为准',
    烹饪: '别当真，这部分很多词是 AI 自动补全的。',
    婴儿: 'ABDL',
    露出性爱: '建议遵守法律法规和公序良俗。',
    强制服药: '仅信任',
    '佩戴饰品(隐蔽)': '例如小徽章、不明显的手环/项链/项圈',
    '佩戴饰品(明显)': '例如有明显铭牌的项圈',
    'SP(轻度)': '当天或次日无痕迹',
    'SP(中度)': '痕迹持续半周',
    'SP(重度)': '痕迹持续一到三周',
    电击按摩: '警告：请遵守电击器使用规范，否则可能导致死亡。',
    冰块插入: '警告：视程度可能导致死亡。'
  }
}

export const config: Config = {
  v1: {
    bitSize: 12,
    ratingType: 'xp-star',
    // @ts-expect-error
    items: v1Data.sections.filter(el => el.items).reduce<string[]>((acc, cur) => acc.concat(cur.items), []),
    ...v1Data
  }
}
